# SQL - PYTHON 1

In [1]:
!pip install mysql

Requirement already satisfied: mysql in c:\users\nehas\anaconda3\lib\site-packages (0.0.3)
Requirement already satisfied: mysqlclient in c:\users\nehas\anaconda3\lib\site-packages (from mysql) (2.2.0)

In [2]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\nehas\anaconda3\lib\site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\nehas\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.1)

In [1]:
import mysql.connector    # CONNECTING TO DATABASE

In [2]:
db =mysql.connector.connect(
    host="localhost",
    user="root",
    password="Silvershark@1988"
)

print(db)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001F7FAB876A0>

In [3]:
# Checking database

cursor=db.cursor()

In [4]:
cursor.execute("SHOW DATABASES")

In [5]:
for i in cursor:
    print(i)

('database1',)
('database2',)
('information_schema',)
('mysql',)
('nehadb',)
('performance_schema',)
('sys',)

In [7]:
# Create a new database

cursor.execute("CREATE DATABASE database3")                # execute command to be typed always

In [8]:
#Checking the new database which created

cursor.execute("SHOW DATABASES")

for i in cursor:
    print(i)

('database1',)
('database2',)
('database3',)
('information_schema',)
('mysql',)
('nehadb',)
('performance_schema',)
('sys',)

In [12]:
# Create Table. Mention the database where you want to create tables.

db=mysql.connector.connect(
    host="localhost",
    user="root",
    password="Silvershark@1988",
    database="database3"
)

In [13]:
cursor=db.cursor()
cursor.execute("CREATE TABLE school(gender VARCHAR(6), student_id INTEGER(10), marks INTEGER(3))")

In [14]:
# Check if any tables availables

cursor.execute("show tables")

for i in cursor:
    print(i)

('school',)

## DATA INSERTION

### SINGLE RECORD INSERTION

In [15]:
db=mysql.connector.connect(
    host="localhost",
    user="root",
    password="Silvershark@1988",
    database="database3"
)

cursor=db.cursor()

sql="INSERT INTO school (gender, student_id, marks) VALUES ('Male',12345,33)"

cursor.execute(sql)

db.commit()   #To save the data permanently

print(cursor.rowcount,"RECORD INSERTED")   # row count is a method to count the row

1 RECORD INSERTED

### MULTIPLE RECORD INSERTION

In [16]:
sql="INSERT INTO school(gender , student_id , marks)VALUES ('Male',123456,34),('Female',253468,56),('Female',256511,22),('male',567891234,82),('male',78912345,66),('female',891234567,55),('female',912345678,63)"

cursor.execute(sql)

In [17]:
db.commit

print(cursor.rowcount,"RECORD INSERTED")

7 RECORD INSERTED

### ANOTHER WAY OF INSERTING A RECORD

In [18]:
sql= "INSERT INTO school ( gender , student_id , marks) VALUES (%s,%s,%s)"

val= (('Male',567891,82),('Male',789125,66),('Female',441267,55),('Female',712678,63))

cursor.executemany(sql,val)   # to execute many values
db.commit()

print(cursor.rowcount,"RECORD INSERTED")

4 RECORD INSERTED

## DATA SELECTION-

In [19]:
# Selecting all (fetchall)

cursor.execute("SELECT * FROM school")

result= cursor.fetchall()   # fetchall means fetch all the records.

for x in result:
    print(x)

('Male', 12345, 33)
('Male', 123456, 34)
('Female', 253468, 56)
('Female', 256511, 22)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 55)
('female', 912345678, 63)
('Male', 567891, 82)
('Male', 789125, 66)
('Female', 441267, 55)
('Female', 712678, 63)

### WHERE condition

In [20]:
# Distinct means only one record out of all.

sql="SELECT DISTINCT * FROM school WHERE student_id = 123456"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

('Male', 123456, 34)

In [21]:
sql="SELECT * FROM school WHERE gender= 'Male'"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

('Male', 12345, 33)
('Male', 123456, 34)
('male', 567891234, 82)
('male', 78912345, 66)
('Male', 567891, 82)
('Male', 789125, 66)

In [22]:
sql="SELECT * FROM school WHERE gender= 'Female'"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

('Female', 253468, 56)
('Female', 256511, 22)
('female', 891234567, 55)
('female', 912345678, 63)
('Female', 441267, 55)
('Female', 712678, 63)

In [23]:
sql="SELECT * FROM school WHERE marks <= 50"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

('Male', 12345, 33)
('Male', 123456, 34)
('Female', 256511, 22)

In [24]:
sql="SELECT * FROM school WHERE marks >= 50"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

('Female', 253468, 56)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 55)
('female', 912345678, 63)
('Male', 567891, 82)
('Male', 789125, 66)
('Female', 441267, 55)
('Female', 712678, 63)

### ORDER BY condition

In [25]:
# Selecting on columns by order

sql="SELECT * FROM school ORDER BY marks DESC"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

('male', 567891234, 82)
('Male', 567891, 82)
('male', 78912345, 66)
('Male', 789125, 66)
('female', 912345678, 63)
('Female', 712678, 63)
('Female', 253468, 56)
('female', 891234567, 55)
('Female', 441267, 55)
('Male', 123456, 34)
('Male', 12345, 33)
('Female', 256511, 22)

In [26]:
sql="SELECT * FROM school ORDER BY marks"   # by default it is in ascending format

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

('Female', 256511, 22)
('Male', 12345, 33)
('Male', 123456, 34)
('female', 891234567, 55)
('Female', 441267, 55)
('Female', 253468, 56)
('female', 912345678, 63)
('Female', 712678, 63)
('male', 78912345, 66)
('Male', 789125, 66)
('male', 567891234, 82)
('Male', 567891, 82)

In [27]:
sql="SELECT * FROM school ORDER BY STUDENT_ID DESC"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

('female', 912345678, 63)
('female', 891234567, 55)
('male', 567891234, 82)
('male', 78912345, 66)
('Male', 789125, 66)
('Female', 712678, 63)
('Male', 567891, 82)
('Female', 441267, 55)
('Female', 256511, 22)
('Female', 253468, 56)
('Male', 123456, 34)
('Male', 12345, 33)

In [28]:
sql="SELECT * FROM school ORDER BY gender "

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

('Female', 253468, 56)
('Female', 256511, 22)
('female', 891234567, 55)
('female', 912345678, 63)
('Female', 441267, 55)
('Female', 712678, 63)
('Male', 12345, 33)
('Male', 123456, 34)
('male', 567891234, 82)
('male', 78912345, 66)
('Male', 567891, 82)
('Male', 789125, 66)

### GROUP BY condition--- is often used with aggregate functions (COUNT(),MAX(),MIN(),SUM(),AVG())to group the result set by one or more columns.

##### avg=sum/count

#### 1) COUNT ()

In [29]:
sql= "SELECT COUNT(student_id), gender from school GROUP BY gender"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

(6, 'Male')
(6, 'Female')

#### 2) SUM()

In [30]:
sql= "SELECT SUM(marks), gender from school GROUP BY gender"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

(Decimal('363'), 'Male')
(Decimal('314'), 'Female')

#### 3)MIN()

In [31]:
sql= "SELECT MIN(marks), gender from school GROUP BY gender"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

(33, 'Male')
(22, 'Female')

#### 4) MAX()

In [32]:
sql= "SELECT MAX(marks), gender from school GROUP BY gender"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

(82, 'Male')
(63, 'Female')

#### 5) AVG()

In [33]:
sql= "SELECT AVG(marks), gender from school GROUP BY gender"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

(Decimal('60.5000'), 'Male')
(Decimal('52.3333'), 'Female')

### HAVING CLAUSE--- Since WHERE clase cannot be used with aggregate functions so having clause is added to SQL.

In [34]:
sql="select count(gender),avg(marks),gender from school group by gender having count(gender)>8"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

## UPDATE THE DATA IN THE TABLE

In [39]:
db=mysql.connector.connect(
    host="localhost",
    user="root",
    password="Silvershark@1988",
    database="database3"
)

cursor=db.cursor()

sql="UPDATE school SET marks = 100 WHERE student_id = 567891"

cursor.execute(sql)
db.commit()

print(cursor.rowcount,'Record affected')

1 Record affected

In [40]:
#Rechecking the table .

sql='SELECT * FROM school'

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

('Male', 12345, 33)
('Male', 123456, 34)
('Female', 253468, 56)
('Female', 256511, 22)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 55)
('female', 912345678, 63)
('Male', 567891, 100)
('Male', 789125, 66)
('Female', 441267, 55)
('Female', 712678, 63)

### LIMIT CLAUSE- it accepcts 1 or 2 arguments .The values of both argument must be zero or positive integer

In [41]:
db=mysql.connector.connect(
    host="localhost",
    user="root",
    password="Silvershark@1988",
    database="database3"
)

cursor=db.cursor()

sql="SELECT * FROM school LIMIT 2,5"  # from 2 row index up to 5 rows

cursor.execute(sql)

res=cursor.fetchall()

for i in res:
    print(i)

('Female', 253468, 56)
('Female', 256511, 22)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 55)

In [42]:
sql="SELECT * FROM school LIMIT 5"   # upto 5 rows from beginning

cursor.execute(sql)

res=cursor.fetchall()

for i in res:
    print(i)

('Male', 12345, 33)
('Male', 123456, 34)
('Female', 253468, 56)
('Female', 256511, 22)
('male', 567891234, 82)

# OPERATORS

### 1) BETWEEN OPERATOR - To determine whether a value is in a range of values

In [43]:
sql="SELECT * FROM school WHERE marks BETWEEN 50 and 80"   # RANGE  of numbers

cursor.execute(sql)

res=cursor.fetchall()

for i in res:
    print(i)

('Female', 253468, 56)
('male', 78912345, 66)
('female', 891234567, 55)
('female', 912345678, 63)
('Male', 789125, 66)
('Female', 441267, 55)
('Female', 712678, 63)

In [44]:
sql="SELECT student_id,marks,gender FROM school WHERE  marks BETWEEN 60 AND 100"

cursor.execute(sql)

cursor.fetchall()

[(567891234, 82, 'male'),
 (78912345, 66, 'male'),
 (912345678, 63, 'female'),
 (567891, 100, 'Male'),
 (789125, 66, 'Male'),
 (712678, 63, 'Female')]

### 2) IN OPERATORS- To determine if a specified value matches any values in a list or a subquery.

In [45]:
sql="SELECT student_id,marks,gender FROM school WHERE  marks IN (33,54,55,67,100)"

cursor.execute(sql)

cursor.fetchall()

[(12345, 33, 'Male'),
 (891234567, 55, 'female'),
 (567891, 100, 'Male'),
 (441267, 55, 'Female')]

### 3) LIKE OPERATORS - To query data based on a specified pattern(WILD CARD).

In [46]:
sql="SELECT student_id,marks,gender FROM school WHERE  marks LIKE '3%'"  # number starts with first digit 3 

cursor.execute(sql)

cursor.fetchall()

[(12345, 33, 'Male'), (123456, 34, 'Male')]

In [47]:
sql="SELECT student_id,marks,gender FROM school WHERE  marks LIKE '5%'"  # number starts with first digit 3 

cursor.execute(sql)

cursor.fetchall()

[(253468, 56, 'Female'), (891234567, 55, 'female'), (441267, 55, 'Female')]

##### in case of name of a person like Anand use 'An%'

In [48]:
sql="SELECT student_id,marks,gender FROM school WHERE gender LIKE 'fe%'"  # number starts with first digit 3 

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

(253468, 56, 'Female')
(256511, 22, 'Female')
(891234567, 55, 'female')
(912345678, 63, 'female')
(441267, 55, 'Female')
(712678, 63, 'Female')

In [49]:
sql="SELECT student_id,marks,gender FROM school WHERE student_id LIKE '%67%'"  # number starts with ANYTHING but 67 should be ib between or in anywhere togther with again wild card at end

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

(567891234, 82, 'male')
(891234567, 55, 'female')
(912345678, 63, 'female')
(567891, 100, 'Male')
(441267, 55, 'Female')
(712678, 63, 'Female')

## COMPARISION OPERATORS

- EQUAL TO   =

- GREATER THAN  >

- LESSER THAN <

- GREATER THAN EQUAL TO  >=

- LESSER THAN <=

- NOT EQUAL TO   <>

In [50]:
# cHANGE THE OPERATORS ACCORDING TO THE NEED

sql= "SELECT * FROM school WHERE marks <> 63"   # not equal to 63

cursor.execute(sql)

cursor.fetchall()

[('Male', 12345, 33),
 ('Male', 123456, 34),
 ('Female', 253468, 56),
 ('Female', 256511, 22),
 ('male', 567891234, 82),
 ('male', 78912345, 66),
 ('female', 891234567, 55),
 ('Male', 567891, 100),
 ('Male', 789125, 66),
 ('Female', 441267, 55)]

In [51]:
sql= "SELECT * FROM school WHERE marks = 56"

cursor.execute(sql)

cursor.fetchall()

[('Female', 253468, 56)]

In [52]:
sql= "SELECT * FROM school WHERE marks > 63"

cursor.execute(sql)

cursor.fetchall()

[('male', 567891234, 82),
 ('male', 78912345, 66),
 ('Male', 567891, 100),
 ('Male', 789125, 66)]

In [53]:
sql= "SELECT * FROM school WHERE marks < 20"

cursor.execute(sql)

cursor.fetchall()

[]

In [54]:
sql= "SELECT * FROM school WHERE marks <= 63"

cursor.execute(sql)

cursor.fetchall()

[('Male', 12345, 33),
 ('Male', 123456, 34),
 ('Female', 253468, 56),
 ('Female', 256511, 22),
 ('female', 891234567, 55),
 ('female', 912345678, 63),
 ('Female', 441267, 55),
 ('Female', 712678, 63)]

In [55]:
sql= "SELECT * FROM school WHERE marks >= 63"

cursor.execute(sql)

cursor.fetchall()

[('male', 567891234, 82),
 ('male', 78912345, 66),
 ('female', 912345678, 63),
 ('Male', 567891, 100),
 ('Male', 789125, 66),
 ('Female', 712678, 63)]

## LOGICAL OPERATOR 

- AND 

- OR

- NOT NULL

#### AND

In [59]:
# AND OPERATOR TO COMBINE MULTIPLE bOOLEAN EXPRESSION TO FILTER DATA

sql= "SELECT * FROM school WHERE gender = 'female' AND marks > 50 "

cursor.execute(sql)

cursor.fetchall()

[('Female', 253468, 56),
 ('female', 891234567, 55),
 ('female', 912345678, 63),
 ('Female', 441267, 55),
 ('Female', 712678, 63)]

In [60]:
sql= "SELECT * FROM school WHERE gender = 'female' AND marks > 50 AND student_id > 912345677"    # all the conditions should be true 

cursor.execute(sql)

cursor.fetchall()

[('female', 912345678, 63)]

#### OR

In [61]:
# OR operator is used to combine boolean opoeration for filtering data.

sql="SELECT student_id, gender, marks FROM school WHERE marks >50 OR gender = 'female'"

cursor.execute(sql)
cursor.fetchall()

[(253468, 'Female', 56),
 (256511, 'Female', 22),
 (567891234, 'male', 82),
 (78912345, 'male', 66),
 (891234567, 'female', 55),
 (912345678, 'female', 63),
 (567891, 'Male', 100),
 (789125, 'Male', 66),
 (441267, 'Female', 55),
 (712678, 'Female', 63)]

#### NOT NULL

In [62]:
# NOT NULL is to filter data on checking null data.

sql="SELECT * FROM school WHERE marks is NOT NULL"

cursor.execute(sql)

cursor.fetchall()

[('Male', 12345, 33),
 ('Male', 123456, 34),
 ('Female', 253468, 56),
 ('Female', 256511, 22),
 ('male', 567891234, 82),
 ('male', 78912345, 66),
 ('female', 891234567, 55),
 ('female', 912345678, 63),
 ('Male', 567891, 100),
 ('Male', 789125, 66),
 ('Female', 441267, 55),
 ('Female', 712678, 63)]

In [63]:
sql="SELECT * FROM school WHERE marks is NULL"

cursor.execute(sql)

cursor.fetchall()

[]

#### no null data is present.

## AGGREGATE FUNNCTIONS-

- COUNT
- MIN
- MAX
- AVG
- SUM

In [65]:
sql="SELECT COUNT(student_id) ,AVG(marks) FROM school "

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

(12, Decimal('57.9167'))

In [67]:
sql="SELECT SUM(marks) FROM school where gender ='male'"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

(Decimal('381'),)

In [71]:
sql="SELECT AVG(marks) FROM school where gender ='Female'"

cursor.execute(sql)

result=cursor.fetchall()

for i in result:
    print(i)

(Decimal('52.3333'),)

In [68]:
sql="select min(marks) from school"

cursor.execute(sql)

cursor.fetchall()

[(22,)]

In [72]:
sql="select min(marks) from school WHERE GENDER ='Male'"

cursor.execute(sql)

cursor.fetchall()

[(33,)]

In [69]:
sql="select max(marks) from school"

cursor.execute(sql)

cursor.fetchall()

[(100,)]

In [70]:
sql="select avg(marks) from school"

cursor.execute(sql)

cursor.fetchall()

[(Decimal('57.9167'),)]

In [73]:
sql="select sum(marks) from school"

cursor.execute(sql)

cursor.fetchall()

[(Decimal('695'),)]

## SQL JOINS

#### JOINS are use to join 2 or more tables.

In [76]:
# Check if any table available-Existing tables

cursor.execute("SHOW TABLES")

cursor.fetchall()

[('school',)]

In [77]:
# Create another table to join 

cursor.execute('CREATE table marks (name VARCHAR(10),student_id INT(10),score INT(3))')

cursor.fetchall()

[]

In [84]:
db=mysql.connector.connect(
    host="localhost",
    user="root",
    password="Silvershark@1988",
    database="database3"
)

cursor=db.cursor()

cursor.execute("show tables")

for i in cursor:
    print(i)

('marks',)
('school',)

In [78]:

cursor.execute("show tables")

for i in cursor:
    print(i)

('marks',)
('school',)

In [79]:
db.commit()

In [85]:
cursor.execute("INSERT into marks VALUES('Nia',712678,63),('KIARA',441267,55),('Faraaz',12345,33),('Kanish',78912345,66),('Yashika',256511,22)")

cursor.fetchall()

db.commit()

In [83]:
cursor.execute("select * from school")

cursor.fetchall()

[('Male', 12345, 33),
 ('Male', 123456, 34),
 ('Female', 253468, 56),
 ('Female', 256511, 22),
 ('male', 567891234, 82),
 ('male', 78912345, 66),
 ('female', 891234567, 55),
 ('female', 912345678, 63),
 ('Male', 567891, 100),
 ('Male', 789125, 66),
 ('Female', 441267, 55),
 ('Female', 712678, 63)]

In [86]:
cursor.execute("select * from marks")

cursor.fetchall()

[('Nia', 3566912, 47),
 ('KIARA', 4642345, 63),
 ('Faraaz', 4565675, 73),
 ('Kanish', 56734567, 46),
 ('Yashika', 234567891, 74),
 ('Nia', 712678, 63),
 ('KIARA', 441267, 55),
 ('Faraaz', 12345, 33),
 ('Kanish', 78912345, 66),
 ('Yashika', 256511, 22)]

### INNER JOINS

In [87]:
# the INNER JOIN matches each row in one tabe with every row in other tables and allows you to query rows that contains columns for both tables

#INNER JOINS only matching


sql= "select school.student_id,school.gender,marks.name,marks.score FROM school INNER JOIN marks on school.student_id = marks.student_id"

cursor.execute(sql)

cursor.fetchall()

[(12345, 'Male', 'Faraaz', 33),
 (256511, 'Female', 'Yashika', 22),
 (78912345, 'male', 'Kanish', 66),
 (441267, 'Female', 'KIARA', 55),
 (712678, 'Female', 'Nia', 63)]

### RIGHT JOINS

In [88]:
# RIGHT JOINS will return matching and non matching with none.

sql="SELECT school.student_id,school.gender,marks.name,marks.score FROM school RIGHT JOIN marks on school.student_id = marks.student_id"

cursor.execute(sql)

cursor.fetchall()

[(None, None, 'Nia', 47),
 (None, None, 'KIARA', 63),
 (None, None, 'Faraaz', 73),
 (None, None, 'Kanish', 46),
 (None, None, 'Yashika', 74),
 (712678, 'Female', 'Nia', 63),
 (441267, 'Female', 'KIARA', 55),
 (12345, 'Male', 'Faraaz', 33),
 (78912345, 'male', 'Kanish', 66),
 (256511, 'Female', 'Yashika', 22)]

## LEFT JOINS

In [89]:
# LEFT JOINS selects data starting from the left table .It matches each row from the left table with every row from the right table based on the join condition

sql="SELECT school.student_id,school.gender,marks.name,marks.score FROM school LEFT JOIN marks on school.student_id = marks.student_id"

cursor.execute(sql)
cursor.fetchall()

[(12345, 'Male', 'Faraaz', 33),
 (123456, 'Male', None, None),
 (253468, 'Female', None, None),
 (256511, 'Female', 'Yashika', 22),
 (567891234, 'male', None, None),
 (78912345, 'male', 'Kanish', 66),
 (891234567, 'female', None, None),
 (912345678, 'female', None, None),
 (567891, 'Male', None, None),
 (789125, 'Male', None, None),
 (441267, 'Female', 'KIARA', 55),
 (712678, 'Female', 'Nia', 63)]

## QUERY OR SUBQUERY

- 1) Primary key
- 2) Foreign Key
- 3) Unique Constraints

#### emp_id is primary key(unique keys or unique data) in parent table 

#### same emp_id is foreign key in child table

#### when we are taking primary key from parent table and refering/comparing it with foreign key of child table , which ever key matches we have to extract/fetched

#### Both primary key(main table) and foreign key(sub table) have sepearte unique keys with same values.

## SUBQUERY OR NESTED QUERY

#### SUBQUERY is a query nested within another query . means SQL within SQL.

#### Subquery is called  an INNER QUERY while query that contains the subquery is called  an OUTER QUERY.

#### A Subquery can be used anywhere that expression is used and must be closed in paraenthesis.

In [91]:
sql= "SELECT student_id,gender FROM school WHERE student_id IN (SELECT student_id FROM marks WHERE marks >60)"

cursor.execute(sql)

result=cursor.fetchall()

for x in result:
    print(x)

(78912345, 'male')
(712678, 'Female')